hyunkoome/ESP32_WIFI_Loc/csi/firmware/csi_recv/sdkconfig.defaults
# CSI 수신 펌웨어 기본 설정.
# 출처: espressif/esp-csi csi_recv/sdkconfig.defaults (Apache-2.0)
# 변경점: 대상 보드 YD-ESP32-S3 N16R8(16MB Flash / 8MB Octal PSRAM) 설정을 추가.
#

# --- 대상 칩 / 메모리 (N16R8) ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# Octal(8-line) 8MB PSRAM — CSI 프레임 버퍼링/대용량 수집에 활용.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y

# --- 원본 CSI 설정 ---
CONFIG_PARTITION_TABLE_OFFSET=0xa000
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=128
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
